## OpenTofu Plan - `cae-dev`

<details><summary>Show Plan</summary>

```hcl
[0;32mChecking environment setup...[0m 
OpenTofu/Terraform: tofu at /home/runner/work/_temp/275c9469-8612-40bb-9f1b-3f08ff3f00d9/tofu
AWS CLI: /usr/local/bin/aws
kubectl: /usr/bin/kubectl
Environment: cae-dev
Region: us-west-2
[0;32mEnvironment check passed[0m 
[0;32mSOPS config exists for environment: cae-dev[0m 
[0;32mInitializing tofu for environment: cae-dev[0m 
{
    "BucketArn": "arn:aws:s3:::tofu-state-jupyterhub-cae-dev-390197508439",
    "BucketRegion": "us-west-2",
    "AccessPointAlias": false
}
/home/runner/work/_temp/275c9469-8612-40bb-9f1b-3f08ff3f00d9/tofu init -backend-config=environments/cae-dev/backend.tfvars -reconfigure

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mInitializing modules...[0m
- acm in modules/acm
- auto_shutdown in modules/auto_shutdown
- cognito in modules/cognito
- eks in modules/eks
- helm in modules/helm
- kms in modules/kms
- kubecost in modules/kubecost
- kubernetes in modules/kubernetes
- monitoring in modules/monitoring
- networking in modules/networking
- s3 in modules/s3

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "~> 5.0"...
- Finding hashicorp/kubernetes versions matching "~> 2.24"...
- Finding hashicorp/helm versions matching "~> 2.12"...
- Finding latest version of hashicorp/tls...
- Finding hashicorp/random versions matching "~> 3.6"...
- Finding carlpett/sops versions matching "~> 1.0"...
- Installing hashicorp/tls v4.1.0...
- Installed hashicorp/tls v4.1.0 (signed, key ID [0m[1m0C0AF313E5FD9F80[0m[0m)
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed, key ID [0m[1m0C0AF313E5FD9F80[0m[0m)
- Installing carlpett/sops v1.3.0...
- Installed carlpett/sops v1.3.0 (signed, key ID [0m[1m1468AC14E6819667[0m[0m)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed, key ID [0m[1m0C0AF313E5FD9F80[0m[0m)
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/kubernetes v2.38.0 (signed, key ID [0m[1m0C0AF313E5FD9F80[0m[0m)
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/helm v2.17.0 (signed, key ID [0m[1m0C0AF313E5FD9F80[0m[0m)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.[0m

[0m[1m[32mOpenTofu has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[0;32mCreating tofu plan for environment: cae-dev[0m 
/home/runner/work/_temp/275c9469-8612-40bb-9f1b-3f08ff3f00d9/tofu plan -var-file=environments/cae-dev/terraform.tfvars -out=tfplan
[0m[1mdata.sops_file.secrets: Reading...[0m[0m
[0m[1mdata.sops_file.secrets: Read complete after 0s [id=-][0m
[0m[1maws_iam_role.user_s3[0]: Refreshing state... [id=jupyterhub-cae-dev-user-s3][0m
[0m[1maws_iam_role.cluster_autoscaler: Refreshing state... [id=jupyterhub-cae-dev-cluster-autoscaler][0m
[0m[1mdata.aws_availability_zones.available: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1maws_iam_role.kubecost[0]: Refreshing state... [id=jupyterhub-cae-dev-kubecost][0m
[0m[1mmodule.acm[0].data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.s3[0].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.networking.aws_vpc.main: Refreshing state... [id=vpc-0d19507eb87bc498d][0m
[0m[1mmodule.acm[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-west-2:390197508439:certificate/e814f3d1-17cc-4fed-858b-10d3ae8071e5][0m
[0m[1mmodule.acm[0].data.aws_region.current: Read complete after 0s [id=us-west-2][0m
[0m[1mmodule.kms.aws_kms_key.eks: Refreshing state... [id=1ddf3957-e761-4248-ac24-2adf3a2d04a9][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=390197508439][0m
[0m[1mmodule.s3[0].data.aws_caller_identity.current: Read complete after 0s [id=390197508439][0m
[0m[1mmodule.s3[0].aws_s3_bucket.scratch: Refreshing state... [id=jupyterhub-cae-dev-scratch-390197508439][0m
[0m[1mmodule.s3[0].aws_s3_bucket.cur[0]: Refreshing state... [id=jupyterhub-cae-dev-cur-390197508439][0m
[0m[1mdata.aws_availability_zones.available: Read complete after 1s [id=us-west-2][0m
[0m[1mmodule.kms.aws_kms_alias.eks: Refreshing state... [id=alias/jupyterhub-cae-dev-eks][0m
[0m[1maws_iam_role_policy.cluster_autoscaler: Refreshing state... [id=jupyterhub-cae-dev-cluster-autoscaler:jupyterhub-cae-dev-cluster-autoscaler-policy][0m
[0m[1mmodule.networking.aws_internet_gateway.main: Refreshing state... [id=igw-0d5dfc2c0c5f9b34e][0m
[0m[1mmodule.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-09a68f2f5f81841bb][0m
[0m[1mmodule.networking.aws_subnet.private[2]: Refreshing state... [id=subnet-007f66abf31bd65b3][0m
[0m[1mmodule.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-099fe75c9a2bd8574][0m
[0m[1mmodule.networking.aws_subnet.public[2]: Refreshing state... [id=subnet-062a7861234153b69][0m
[0m[1mmodule.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-09b59604f209c4ab2][0m
[0m[1mmodule.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-0ed3ebbfc6ab05b07][0m
[0m[1mmodule.networking.aws_subnet.private[3]: Refreshing state... [id=subnet-07bfff10e51dfe000][0m
[0m[1mmodule.networking.aws_subnet.public[3]: Refreshing state... [id=subnet-087ceccedc5fa872a][0m
[0m[1mmodule.s3[0].aws_s3_bucket_public_access_block.scratch: Refreshing state... [id=jupyterhub-cae-dev-scratch-390197508439][0m
[0m[1mmodule.s3[0].aws_s3_bucket_versioning.scratch: Refreshing state... [id=jupyterhub-cae-dev-scratch-390197508439][0m
[0m[1mmodule.s3[0].aws_s3_bucket_lifecycle_configuration.scratch[0]: Refreshing state... [id=jupyterhub-cae-dev-scratch-390197508439][0m
[0m[1mmodule.s3[0].aws_cur_report_definition.kubecost[0]: Refreshing state... [id=jupyterhub-cae-dev-kubecost-cur][0m
[0m[1mmodule.s3[0].aws_s3_bucket_lifecycle_configuration.cur[0]: Refreshing state... [id=jupyterhub-cae-dev-cur-390197508439][0m
[0m[1mmodule.s3[0].aws_s3_bucket_policy.cur[0]: Refreshing state... [id=jupyterhub-cae-dev-cur-390197508439][0m
[0m[1mmodule.s3[0].aws_s3_bucket_public_access_block.cur[0]: Refreshing state... [id=jupyterhub-cae-dev-cur-390197508439][0m
[0m[1mmodule.networking.aws_route_table.public: Refreshing state... [id=rtb-0afb67a34183defaf][0m
[0m[1mmodule.networking.aws_eip.nat[0]: Refreshing state... [id=eipalloc-029a32f8dd4f29102][0m
[0m[1mmodule.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c6623e3b2530fd9f][0m
[0m[1mmodule.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e1a0b0ff675b2146][0m
[0m[1mmodule.networking.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0bb06275fbb1b09fe][0m
[0m[1mmodule.networking.aws_route_table_association.public[3]: Refreshing state... [id=rtbassoc-00d18b3383e540bb9][0m
[0m[1mmodule.networking.aws_nat_gateway.main[0]: Refreshing state... [id=nat-04f8f66d1848a10ae][0m
[0m[1mmodule.networking.aws_route_table.private[0]: Refreshing state... [id=rtb-0182ac2eebe34d085][0m
[0m[1mmodule.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-096fb06fddcb45c4a][0m
[0m[1mmodule.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06fac40f7a21bc5f2][0m
[0m[1mmodule.networking.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-0f2fe632626857e13][0m
[0m[1mmodule.networking.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-061e92aa53bc58e48][0m
[0m[1mmodule.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0d771ea2fb0f84484][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.node_assume_role: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_policy_document.cluster_assume_role: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eks.aws_iam_role.ebs_csi_driver: Refreshing state... [id=jupyterhub-cae-dev-ebs-csi-driver][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.node_assume_role: Read complete after 0s [id=2851119427][0m
[0m[1mmodule.eks.aws_security_group.cluster: Refreshing state... [id=sg-048d3a6ef475d44cb][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.cluster_assume_role: Read complete after 0s [id=3552664922][0m
[0m[1mmodule.eks.aws_launch_template.dask_workers: Refreshing state... [id=lt-0a292dc5c84fba39e][0m
[0m[1mmodule.eks.aws_iam_role.node: Refreshing state... [id=jupyterhub-cae-dev-node-role][0m
[0m[1mmodule.eks.data.aws_region.current: Read complete after 0s [id=us-west-2][0m
[0m[1mmodule.eks.aws_iam_role.cluster: Refreshing state... [id=jupyterhub-cae-dev-cluster-role][0m
[0m[1mmodule.eks.aws_launch_template.main: Refreshing state... [id=lt-01207aa2981bc55cf][0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Read complete after 0s [id=390197508439][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.ebs_csi_driver: Refreshing state... [id=jupyterhub-cae-dev-ebs-csi-driver-20251231224652279900000012][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=jupyterhub-cae-dev-cluster-role-20251231224652201900000011][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.cluster_vpc_policy: Refreshing state... [id=jupyterhub-cae-dev-cluster-role-20251231224652176200000010][0m
[0m[1maws_iam_role_policy.user_s3[0]: Refreshing state... [id=jupyterhub-cae-dev-user-s3:jupyterhub-cae-dev-user-s3-policy][0m
[0m[1maws_iam_role_policy.kubecost[0]: Refreshing state... [id=jupyterhub-cae-dev-kubecost:jupyterhub-cae-dev-kubecost-policy][0m
[0m[1mmodule.eks.aws_eks_cluster.main: Refreshing state... [id=jupyterhub-cae-dev][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.node_cni_policy: Refreshing state... [id=jupyterhub-cae-dev-node-role-2025123122465208930000000d][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.node_ssm_policy: Refreshing state... [id=jupyterhub-cae-dev-node-role-2025123122465216470000000f][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.node_registry_policy: Refreshing state... [id=jupyterhub-cae-dev-node-role-2025123122465210760000000e][0m
[0m[1mmodule.eks.aws_iam_role_policy.node_ebs_policy: Refreshing state... [id=jupyterhub-cae-dev-node-role:jupyterhub-cae-dev-node-ebs-policy][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.node_policy: Refreshing state... [id=jupyterhub-cae-dev-node-role-2025123122465206480000000c][0m
[0m[1mmodule.eks.aws_eks_node_group.user_medium[0]: Refreshing state... [id=jupyterhub-cae-dev:jupyterhub-cae-dev-user-medium][0m
[0m[1mmodule.eks.aws_eks_node_group.system[0]: Refreshing state... [id=jupyterhub-cae-dev:jupyterhub-cae-dev-system][0m
[0m[1mmodule.eks.aws_eks_node_group.user_small[0]: Refreshing state... [id=jupyterhub-cae-dev:jupyterhub-cae-dev-user-small][0m
[0m[1mmodule.eks.aws_eks_addon.vpc_cni: Refreshing state... [id=jupyterhub-cae-dev:vpc-cni][0m
[0m[1mmodule.eks.data.tls_certificate.cluster: Reading...[0m[0m
[0m[1mmodule.eks.aws_eks_node_group.dask_workers: Refreshing state... [id=jupyterhub-cae-dev:jupyterhub-cae-dev-dask-workers][0m
[0m[1mmodule.eks.aws_eks_addon.coredns: Refreshing state... [id=jupyterhub-cae-dev:coredns][0m
[0m[1mmodule.eks.aws_eks_addon.pod_identity: Refreshing state... [id=jupyterhub-cae-dev:eks-pod-identity-agent][0m
[0m[1mmodule.eks.aws_eks_addon.kube_proxy: Refreshing state... [id=jupyterhub-cae-dev:kube-proxy][0m
[0m[1mmodule.eks.aws_autoscaling_schedule.user_small_scale_down[0]: Refreshing state... [id=jupyterhub-cae-dev-user-small-scale-down][0m
[0m[1mmodule.eks.aws_autoscaling_schedule.user_small_scale_up[0]: Refreshing state... [id=jupyterhub-cae-dev-user-small-scale-up][0m
[0m[1mmodule.eks.data.tls_certificate.cluster: Read complete after 0s [id=4687b9863b4f2caa907e2ad6c9ffcf73433dc367][0m
[0m[1mmodule.eks.aws_iam_openid_connect_provider.cluster: Refreshing state... [id=arn:aws:iam::390197508439:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/DBDB2FC6ED2E254E4B5D50E3B80C7997][0m
[0m[1mmodule.eks.aws_autoscaling_schedule.user_medium_scale_up[0]: Refreshing state... [id=jupyterhub-cae-dev-user-medium-scale-up][0m
[0m[1mmodule.eks.aws_autoscaling_schedule.user_medium_scale_down[0]: Refreshing state... [id=jupyterhub-cae-dev-user-medium-scale-down][0m
[0m[1mmodule.eks.aws_eks_pod_identity_association.ebs_csi_driver: Refreshing state... [id=a-msfzj5x2wfj19uetv][0m
[0m[1mmodule.eks.aws_eks_addon.ebs_csi_driver: Refreshing state... [id=jupyterhub-cae-dev:aws-ebs-csi-driver][0m

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

OpenTofu will perform the following actions:

[1m  # aws_ecr_pull_through_cache_rule.ghcr[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_pull_through_cache_rule" "ghcr" {
      [32m+[0m[0m credential_arn        = (known after apply)
      [32m+[0m[0m ecr_repository_prefix = "ghcr"
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m registry_id           = (known after apply)
      [32m+[0m[0m upstream_registry_url = "ghcr.io"
    }

[1m  # aws_eks_pod_identity_association.cluster_autoscaler[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_pod_identity_association" "cluster_autoscaler" {
      [32m+[0m[0m association_arn = (known after apply)
      [32m+[0m[0m association_id  = (known after apply)
      [32m+[0m[0m cluster_name    = "jupyterhub-cae-dev"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m namespace       = "kube-system"
      [32m+[0m[0m role_arn        = "arn:aws:iam::390197508439:role/jupyterhub-cae-dev-cluster-autoscaler"
      [32m+[0m[0m service_account = "cluster-autoscaler"
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Application" = "jupyterhub"
          [32m+[0m[0m "CostCenter"  = "cae-dev"
          [32m+[0m[0m "Environment" = "cae-dev"
          [32m+[0m[0m "Owner"       = "refuge@rocktalus.com"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # aws_eks_pod_identity_association.kubecost[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_pod_identity_association" "kubecost" {
      [32m+[0m[0m association_arn = (known after apply)
      [32m+[0m[0m association_id  = (known after apply)
      [32m+[0m[0m cluster_name    = "jupyterhub-cae-dev"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m namespace       = "kubecost"
      [32m+[0m[0m role_arn        = "arn:aws:iam::390197508439:role/jupyterhub-cae-dev-kubecost"
      [32m+[0m[0m service_account = "kubecost-cost-analyzer"
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Application" = "jupyterhub"
          [32m+[0m[0m "CostCenter"  = "cae-dev"
          [32m+[0m[0m "Environment" = "cae-dev"
          [32m+[0m[0m "Owner"       = "refuge@rocktalus.com"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # aws_eks_pod_identity_association.user_s3[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_pod_identity_association" "user_s3" {
      [32m+[0m[0m association_arn = (known after apply)
      [32m+[0m[0m association_id  = (known after apply)
      [32m+[0m[0m cluster_name    = "jupyterhub-cae-dev"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m namespace       = "daskhub"
      [32m+[0m[0m role_arn        = "arn:aws:iam::390197508439:role/jupyterhub-cae-dev-user-s3"
      [32m+[0m[0m service_account = "user-sa"
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Application" = "jupyterhub"
          [32m+[0m[0m "CostCenter"  = "cae-dev"
          [32m+[0m[0m "Environment" = "cae-dev"
          [32m+[0m[0m "Owner"       = "refuge@rocktalus.com"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # aws_secretsmanager_secret.ghcr_credentials[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret" "ghcr_credentials" {
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m description                    = "GitHub Container Registry credentials for ECR pull-through cache"
      [32m+[0m[0m force_overwrite_replica_secret = false
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m name                           = "ecr-pullthroughcache/ghcr"
      [32m+[0m[0m name_prefix                    = (known after apply)
      [32m+[0m[0m policy                         = (known after apply)
      [32m+[0m[0m recovery_window_in_days        = 30
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Application" = "jupyterhub"
          [32m+[0m[0m "CostCenter"  = "cae-dev"
          [32m+[0m[0m "Environment" = "cae-dev"
          [32m+[0m[0m "Owner"       = "refuge@rocktalus.com"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Application" = "jupyterhub"
          [32m+[0m[0m "CostCenter"  = "cae-dev"
          [32m+[0m[0m "Environment" = "cae-dev"
          [32m+[0m[0m "Owner"       = "refuge@rocktalus.com"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # aws_secretsmanager_secret_version.ghcr_credentials[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "ghcr_credentials" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = (known after apply)
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = (known after apply)
    }

[1m  # module.acm[0].aws_acm_certificate.cert[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_acm_certificate" "cert" {
        id                        = "arn:aws:acm:us-west-2:390197508439:certificate/e814f3d1-17cc-4fed-858b-10d3ae8071e5"
        tags                      = {
            "Application" = "jupyterhub"
            "CostCenter"  = "cae-dev"
            "Environment" = "cae-dev"
            "Owner"       = "refuge@rocktalus.com"
            "Terraform"   = "true"
        }
        [90m# (13 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.eks.aws_eks_access_entry.admin_users["arn:aws:iam::390197508439:user/neil.AE"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_entry" "admin_users" {
      [32m+[0m[0m access_entry_arn  = (known after apply)
      [32m+[0m[0m cluster_name      = "jupyterhub-cae-dev"
      [32m+[0m[0m created_at        = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m kubernetes_groups = (known after apply)
      [32m+[0m[0m modified_at       = (known after apply)
      [32m+[0m[0m principal_arn     = "arn:aws:iam::390197508439:user/neil.AE"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Application" = "jupyterhub"
          [32m+[0m[0m "CostCenter"  = "cae-dev"
          [32m+[0m[0m "Environment" = "cae-dev"
          [32m+[0m[0m "Owner"       = "refuge@rocktalus.com"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Application" = "jupyterhub"
          [32m+[0m[0m "CostCenter"  = "cae-dev"
          [32m+[0m[0m "Environment" = "cae-dev"
          [32m+[0m[0m "Owner"       = "refuge@rocktalus.com"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m type              = "STANDARD"
      [32m+[0m[0m user_name         = (known after apply)
    }

[1m  # module.eks.aws_eks_access_policy_association.admin_users["arn:aws:iam::390197508439:user/neil.AE"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_policy_association" "admin_users" {
      [32m+[0m[0m associated_at = (known after apply)
      [32m+[0m[0m cluster_name  = "jupyterhub-cae-dev"
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m modified_at   = (known after apply)
      [32m+[0m[0m policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      [32m+[0m[0m principal_arn = "arn:aws:iam::390197508439:user/neil.AE"

      [32m+[0m[0m access_scope {
          [32m+[0m[0m type = "cluster"
        }
    }

[1m  # module.eks.aws_eks_node_group.dask_workers[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_node_group" "dask_workers" {
        id              = "jupyterhub-cae-dev:jupyterhub-cae-dev-dask-workers"
        tags            = {
            "Application"                                  = "jupyterhub"
            "CostCenter"                                   = "cae-dev"
            "Environment"                                  = "cae-dev"
            "Name"                                         = "jupyterhub-cae-dev-dask-worker-node"
            "Owner"                                        = "refuge@rocktalus.com"
            "Terraform"                                    = "true"
            "k8s.io/cluster-autoscaler/enabled"            = "true"
            "k8s.io/cluster-autoscaler/jupyterhub-cae-dev" = "owned"
        }
        [90m# (15 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m launch_template {
            id      = "lt-0a292dc5c84fba39e"
            name    = "jupyterhub-cae-dev-dask-2025123122465151390000000a"
          [33m~[0m[0m version = "1" [33m->[0m[0m "$Latest"
        }

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.helm.helm_release.cluster_autoscaler[0m will be created
[0m  [32m+[0m[0m resource "helm_release" "cluster_autoscaler" {
      [32m+[0m[0m atomic                     = false
      [32m+[0m[0m chart                      = "cluster-autoscaler"
      [32m+[0m[0m cleanup_on_fail            = false
      [32m+[0m[0m create_namespace           = false
      [32m+[0m[0m dependency_update          = false
      [32m+[0m[0m disable_crd_hooks          = false
      [32m+[0m[0m disable_openapi_validation = false
      [32m+[0m[0m disable_webhooks           = false
      [32m+[0m[0m force_update               = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m lint                       = false
      [32m+[0m[0m manifest                   = (known after apply)
      [32m+[0m[0m max_history                = 0
      [32m+[0m[0m metadata                   = (known after apply)
      [32m+[0m[0m name                       = "cluster-autoscaler"
      [32m+[0m[0m namespace                  = "kube-system"
      [32m+[0m[0m pass_credentials           = false
      [32m+[0m[0m recreate_pods              = false
      [32m+[0m[0m render_subchart_notes      = true
      [32m+[0m[0m replace                    = false
      [32m+[0m[0m repository                 = "https://kubernetes.github.io/autoscaler"
      [32m+[0m[0m reset_values               = false
      [32m+[0m[0m reuse_values               = false
      [32m+[0m[0m skip_crds                  = false
      [32m+[0m[0m status                     = "deployed"
      [32m+[0m[0m timeout                    = 300
      [32m+[0m[0m values                     = [
          [32m+[0m[0m <<-EOT
                "autoDiscovery":
                  "clusterName": "jupyterhub-cae-dev"
                "awsRegion": "us-west-2"
                "extraArgs":
                  "balance-similar-node-groups": true
                  "skip-nodes-with-system-pods": false
                "rbac":
                  "serviceAccount":
                    "create": true
                    "name": "cluster-autoscaler"
            EOT,
        ]
      [32m+[0m[0m verify                     = false
      [32m+[0m[0m version                    = "9.37.0"
      [32m+[0m[0m wait                       = true
      [32m+[0m[0m wait_for_jobs              = false
    }

[1m  # module.helm.helm_release.daskhub[0][0m will be created
[0m  [32m+[0m[0m resource "helm_release" "daskhub" {
      [32m+[0m[0m atomic                     = false
      [32m+[0m[0m chart                      = "daskhub"
      [32m+[0m[0m cleanup_on_fail            = false
      [32m+[0m[0m create_namespace           = false
      [32m+[0m[0m dependency_update          = false
      [32m+[0m[0m disable_crd_hooks          = false
      [32m+[0m[0m disable_openapi_validation = false
      [32m+[0m[0m disable_webhooks           = false
      [32m+[0m[0m force_update               = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m lint                       = false
      [32m+[0m[0m manifest                   = (known after apply)
      [32m+[0m[0m max_history                = 0
      [32m+[0m[0m metadata                   = (known after apply)
      [32m+[0m[0m name                       = "daskhub"
      [32m+[0m[0m namespace                  = "daskhub"
      [32m+[0m[0m pass_credentials           = false
      [32m+[0m[0m recreate_pods              = false
      [32m+[0m[0m render_subchart_notes      = true
      [32m+[0m[0m replace                    = false
      [32m+[0m[0m repository                 = "https://helm.dask.org"
      [32m+[0m[0m reset_values               = false
      [32m+[0m[0m reuse_values               = false
      [32m+[0m[0m skip_crds                  = false
      [32m+[0m[0m status                     = "deployed"
      [32m+[0m[0m timeout                    = 1200
      [32m+[0m[0m values                     = [
          [32m+[0m[0m <<-EOT
                "dask-gateway":
                  "gateway":
                    "backend":
                      "scheduler":
                        "extraPodConfig":
                          "serviceAccountName": "user-sa"
                      "worker":
                        "extraPodConfig":
                          "nodeSelector":
                            "eks.amazonaws.com/capacityType": "SPOT"
                          "serviceAccountName": "user-sa"
                          "tolerations":
                          - "effect": "NoExecute"
                            "key": "lifecycle"
                            "operator": "Equal"
                            "value": "spot"
                    "extraConfig":
                      "optionHandler": |
                        from dask_gateway_server.options import Options, Float, String, Mapping
                        def cluster_options(user):
                            def option_handler(options):
                                if ":" not in options.image:
                                    raise ValueError("When specifying an image you must also provide a tag")
                                extra_annotations = {"hub.jupyter.org/username": user.name.replace('@', '_')}
                                extra_labels = extra_annotations
                                return {
                                    "worker_cores": 0.88 * min(options.worker_cores / 2, 1),
                                    "worker_cores_limit": options.worker_cores,
                                    "worker_memory": "%fG" % (0.88 * options.worker_memory),
                                    "worker_memory_limit": "%fG" % options.worker_memory,
                                    "image": options.image,
                                    "environment": options.environment,
                                    "extra_annotations": extra_annotations,
                                    "extra_labels": extra_labels,
                                }
                            return Options(
                                Float("worker_cores", 4, min=1, max=4),
                                Float("worker_memory", 16, min=1, max=16),
                                String("image", default="390197508439.dkr.ecr.us-west-2.amazonaws.com/ghcr/espg/cae-notebook:latest"),
                                Mapping("environment", {}),
                                handler=option_handler,
                            )
                        c.Backend.cluster_options = cluster_options
                        c.ClusterConfig.idle_timeout = 1800
                        c.ClusterConfig.cluster_max_cores = 20
                "daskhub":
                  "rbac":
                    "enabled": true
                "jupyterhub":
                  "hub":
                    "config":
                      "Authenticator":
                        "admin_users":
                        - "refuge@rocktalus.com"
                        "allow_all": true
                      "GenericOAuthenticator":
                        "authorize_url": "https://cae-dev-hub.auth.us-west-1.amazoncognito.com/oauth2/authorize"
                        "client_id": "4fumjktp49ajd8tvrf6glevbfr"
                        "login_service": "AWS Cognito"
                        "logout_redirect_url": "https://cae-dev-hub.auth.us-west-1.amazoncognito.com/logout?client_id=4fumjktp49ajd8tvrf6glevbfr&logout_uri=https://cae-dev.rocktalus.com"
                        "oauth_callback_url": "https://cae-dev.rocktalus.com/hub/oauth_callback"
                        "token_url": "https://cae-dev-hub.auth.us-west-1.amazoncognito.com/oauth2/token"
                        "userdata_url": "https://cae-dev-hub.auth.us-west-1.amazoncognito.com/oauth2/userInfo"
                        "username_claim": "email"
                      "GitHubOAuthenticator":
                        "allowed_organizations": []
                        "client_id": ""
                        "client_secret": ""
                        "oauth_callback_url": ""
                      "JupyterHub":
                        "authenticator_class": "generic-oauth"
                      "KubeSpawner":
                        "container_security_context":
                          "allowPrivilegeEscalation": true
                          "runAsGroup": 100
                          "runAsUser": 1000
                    "nodeSelector":
                      "role": "system"
                    "services":
                      "kubecost":
                        "admin": false
                        "display": true
                        "url": "http://kubecost-proxy.kubecost.svc.cluster.local:9090"
                    "shutdownOnLogout": true
                  "prePuller":
                    "continuous":
                      "enabled": false
                    "extraImages": {}
                    "pullProfileListImages": false
                  "proxy":
                    "chp":
                      "nodeSelector":
                        "role": "system"
                    "https":
                      "enabled": false
                    "service":
                      "annotations":
                        "service.beta.kubernetes.io/aws-load-balancer-nlb-target-type": "ip"
                        "service.beta.kubernetes.io/aws-load-balancer-scheme": "internet-facing"
                        "service.beta.kubernetes.io/aws-load-balancer-ssl-cert": "arn:aws:acm:us-west-2:390197508439:certificate/e814f3d1-17cc-4fed-858b-10d3ae8071e5"
                        "service.beta.kubernetes.io/aws-load-balancer-ssl-ports": "443"
                        "service.beta.kubernetes.io/aws-load-balancer-type": "nlb"
                      "extraPorts":
                      - "name": "https"
                        "port": 443
                        "targetPort": "http"
                      "type": "LoadBalancer"
                  "scheduling":
                    "userScheduler":
                      "nodeSelector":
                        "role": "system"
                  "singleuser":
                    "cpu": null
                    "defaultUrl": "/lab"
                    "extraEnv":
                      "DASK_GATEWAY__ADDRESS": "http://proxy-public/services/dask-gateway"
                      "DASK_GATEWAY__CLUSTER__OPTIONS__IMAGE": "{{JUPYTER_IMAGE_SPEC}}"
                      "SCRATCH_BUCKET": "s3://jupyterhub-cae-dev-scratch-390197508439/$(JUPYTERHUB_USER)"
                    "extraFiles":
                      "jupyter_notebook_config.json":
                        "data":
                          "MappingKernelManager":
                            "cull_busy": false
                            "cull_connected": true
                            "cull_idle_timeout": 600
                            "cull_interval": 120
                        "mountPath": "/etc/jupyter/jupyter_notebook_config.json"
                    "image":
                      "name": "390197508439.dkr.ecr.us-west-2.amazonaws.com/ghcr/espg/cae-notebook"
                      "tag": "latest"
                    "lifecycleHooks":
                      "postStart":
                        "exec":
                          "command":
                          - "sh"
                          - "-c"
                          - "python -m nbgitpuller https://github.com/cal-adapt/cae-notebooks main
                            cae-notebooks || true"
                    "memory": null
                    "nodeSelector": null
                    "profileList":
                    - "default": true
                      "description": "Standard JupyterLab environment"
                      "display_name": "Small (2 CPU, 14 GB)"
                      "kubespawner_override":
                        "cpu_guarantee": 1.6
                        "cpu_limit": 2
                        "mem_guarantee": "14G"
                        "mem_limit": "15G"
                        "node_selector":
                          "role": "user"
                          "size": "small"
                      "profile_options":
                        "image":
                          "choices":
                            "default":
                              "default": true
                              "display_name": "Default (latest)"
                              "kubespawner_override":
                                "image": "390197508439.dkr.ecr.us-west-2.amazonaws.com/ghcr/espg/cae-notebook:latest"
                            "pangeo":
                              "default": false
                              "description": "Standard Pangeo stack - JupyterLab only, no VSCode/RStudio"
                              "display_name": "Pangeo Notebook (no VSCode)"
                              "kubespawner_override":
                                "image": "pangeo/pangeo-notebook:2025.01.10"
                            "scipy":
                              "default": false
                              "description": "Jupyter's official SciPy notebook - JupyterLab only"
                              "display_name": "SciPy Notebook (no VSCode)"
                              "kubespawner_override":
                                "image": "jupyter/scipy-notebook:latest"
                          "display_name": "Image"
                          "unlisted_choice":
                            "description_in_choices": "Use any publicly available Docker image (format:
                              image:tag)"
                            "display_name": "Custom image"
                            "display_name_in_choices": "Specify a custom Docker image"
                            "enabled": true
                            "kubespawner_override":
                              "image": "{value}"
                            "validation_message": "Must be a valid Docker image with tag (e.g., pangeo/pangeo-notebook:2025.01.10)"
                            "validation_regex": "^.+:.+$"
                    - "default": false
                      "description": "For larger datasets and heavier computation"
                      "display_name": "Medium (4 CPU, 28 GB)"
                      "kubespawner_override":
                        "cpu_guarantee": 3.5
                        "cpu_limit": 4
                        "mem_guarantee": "28G"
                        "mem_limit": "30G"
                        "node_selector":
                          "role": "user"
                          "size": "medium"
                      "profile_options":
                        "image":
                          "choices":
                            "default":
                              "default": true
                              "display_name": "Default (latest)"
                              "kubespawner_override":
                                "image": "390197508439.dkr.ecr.us-west-2.amazonaws.com/ghcr/espg/cae-notebook:latest"
                            "pangeo":
                              "default": false
                              "description": "Standard Pangeo stack - JupyterLab only, no VSCode/RStudio"
                              "display_name": "Pangeo Notebook (no VSCode)"
                              "kubespawner_override":
                                "image": "pangeo/pangeo-notebook:2025.01.10"
                            "scipy":
                              "default": false
                              "description": "Jupyter's official SciPy notebook - JupyterLab only"
                              "display_name": "SciPy Notebook (no VSCode)"
                              "kubespawner_override":
                                "image": "jupyter/scipy-notebook:latest"
                          "display_name": "Image"
                          "unlisted_choice":
                            "description_in_choices": "Use any publicly available Docker image (format:
                              image:tag)"
                            "display_name": "Custom image"
                            "display_name_in_choices": "Specify a custom Docker image"
                            "enabled": true
                            "kubespawner_override":
                              "image": "{value}"
                            "validation_message": "Must be a valid Docker image with tag (e.g., pangeo/pangeo-notebook:2025.01.10)"
                            "validation_regex": "^.+:.+$"
                    "serviceAccountName": "user-sa"
                    "startTimeout": 600
            EOT,
        ]
      [32m+[0m[0m verify                     = false
      [32m+[0m[0m version                    = "2024.1.1"
      [32m+[0m[0m wait                       = true
      [32m+[0m[0m wait_for_jobs              = true

      [32m+[0m[0m set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

[1m  # module.kubecost[0].helm_release.kubecost[0m will be created
[0m  [32m+[0m[0m resource "helm_release" "kubecost" {
      [32m+[0m[0m atomic                     = false
      [32m+[0m[0m chart                      = "cost-analyzer"
      [32m+[0m[0m cleanup_on_fail            = false
      [32m+[0m[0m create_namespace           = false
      [32m+[0m[0m dependency_update          = false
      [32m+[0m[0m disable_crd_hooks          = false
      [32m+[0m[0m disable_openapi_validation = false
      [32m+[0m[0m disable_webhooks           = false
      [32m+[0m[0m force_update               = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m lint                       = false
      [32m+[0m[0m manifest                   = (known after apply)
      [32m+[0m[0m max_history                = 0
      [32m+[0m[0m metadata                   = (known after apply)
      [32m+[0m[0m name                       = "kubecost"
      [32m+[0m[0m namespace                  = "kubecost"
      [32m+[0m[0m pass_credentials           = false
      [32m+[0m[0m recreate_pods              = false
      [32m+[0m[0m render_subchart_notes      = true
      [32m+[0m[0m replace                    = false
      [32m+[0m[0m repository                 = "https://kubecost.github.io/cost-analyzer/"
      [32m+[0m[0m reset_values               = false
      [32m+[0m[0m reuse_values               = false
      [32m+[0m[0m skip_crds                  = false
      [32m+[0m[0m status                     = "deployed"
      [32m+[0m[0m timeout                    = 600
      [32m+[0m[0m values                     = [
          [32m+[0m[0m <<-EOT
                "global":
                  "prometheus":
                    "enabled": true
                    "fqdn": "http://kubecost-prometheus-server.kubecost.svc"
                "grafana":
                  "enabled": false
                "ingress":
                  "enabled": false
                "kubecostDeployment":
                  "replicas": 1
                "kubecostModel":
                  "etl": true
                  "warmCache": true
                  "warmSavingsCache": true
                "networkCosts":
                  "enabled": true
                "nodeSelector":
                  "role": "system"
                "prometheus":
                  "alertmanager":
                    "enabled": false
                  "kubeStateMetrics":
                    "enabled": true
                  "nodeExporter":
                    "enabled": true
                  "pushgateway":
                    "enabled": false
                  "server":
                    "nodeSelector":
                      "role": "system"
                    "persistentVolume":
                      "enabled": true
                      "size": "32Gi"
                    "resources":
                      "limits":
                        "cpu": "2000m"
                        "memory": "4Gi"
                      "requests":
                        "cpu": "500m"
                        "memory": "2Gi"
                    "retention": "15d"
                    "tolerations": []
                "service":
                  "port": 9090
                  "type": "ClusterIP"
                "serviceAccount":
                  "create": false
                  "name": "kubecost-cost-analyzer"
                "tolerations": []
            EOT,
        ]
      [32m+[0m[0m verify                     = false
      [32m+[0m[0m version                    = "1.108.1"
      [32m+[0m[0m wait                       = true
      [32m+[0m[0m wait_for_jobs              = false
    }

[1m  # module.kubecost[0].kubernetes_config_map.kubecost_proxy[0][0m will be created
[0m  [32m+[0m[0m resource "kubernetes_config_map" "kubecost_proxy" {
      [32m+[0m[0m data = {
          [32m+[0m[0m "nginx.conf" = <<-EOT
                events {
                  worker_connections 1024;
                }
                
                http {
                  upstream kubecost {
                    server kubecost-cost-analyzer:9090;
                  }
                
                  server {
                    listen 8080;
                
                    # Strip /services/kubecost prefix and proxy to Kubecost
                    # Handles both /services/kubecost and /services/kubecost/...
                    location /services/kubecost {
                      rewrite ^/services/kubecost/?(.*)$ /$1 break;
                      proxy_pass http://kubecost;
                      proxy_set_header Host $host;
                      proxy_set_header X-Real-IP $remote_addr;
                      proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                      proxy_set_header X-Forwarded-Proto $scheme;
                
                      # WebSocket support for live updates
                      proxy_http_version 1.1;
                      proxy_set_header Upgrade $http_upgrade;
                      proxy_set_header Connection "upgrade";
                
                      # Timeouts for long-running requests
                      proxy_connect_timeout 60s;
                      proxy_send_timeout 60s;
                      proxy_read_timeout 60s;
                    }
                
                    # Health check endpoint
                    location /healthz {
                      return 200 "OK\n";
                      add_header Content-Type text/plain;
                    }
                  }
                }
            EOT
        }
      [32m+[0m[0m id   = (known after apply)

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m name             = "kubecost-proxy-config"
          [32m+[0m[0m namespace        = "kubecost"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # module.kubecost[0].kubernetes_deployment.kubecost_proxy[0][0m will be created
[0m  [32m+[0m[0m resource "kubernetes_deployment" "kubecost_proxy" {
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m wait_for_rollout = true

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m labels           = {
              [32m+[0m[0m "app" = "kubecost-proxy"
            }
          [32m+[0m[0m name             = "kubecost-proxy"
          [32m+[0m[0m namespace        = "kubecost"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }

      [32m+[0m[0m spec {
          [32m+[0m[0m min_ready_seconds         = 0
          [32m+[0m[0m paused                    = false
          [32m+[0m[0m progress_deadline_seconds = 600
          [32m+[0m[0m replicas                  = "1"
          [32m+[0m[0m revision_history_limit    = 10

          [32m+[0m[0m selector {
              [32m+[0m[0m match_labels = {
                  [32m+[0m[0m "app" = "kubecost-proxy"
                }
            }

          [32m+[0m[0m template {
              [32m+[0m[0m metadata {
                  [32m+[0m[0m generation       = (known after apply)
                  [32m+[0m[0m labels           = {
                      [32m+[0m[0m "app" = "kubecost-proxy"
                    }
                  [32m+[0m[0m name             = (known after apply)
                  [32m+[0m[0m resource_version = (known after apply)
                  [32m+[0m[0m uid              = (known after apply)
                }
              [32m+[0m[0m spec {
                  [32m+[0m[0m automount_service_account_token  = true
                  [32m+[0m[0m dns_policy                       = "ClusterFirst"
                  [32m+[0m[0m enable_service_links             = true
                  [32m+[0m[0m host_ipc                         = false
                  [32m+[0m[0m host_network                     = false
                  [32m+[0m[0m host_pid                         = false
                  [32m+[0m[0m hostname                         = (known after apply)
                  [32m+[0m[0m node_name                        = (known after apply)
                  [32m+[0m[0m node_selector                    = {
                      [32m+[0m[0m "role" = "system"
                    }
                  [32m+[0m[0m restart_policy                   = "Always"
                  [32m+[0m[0m scheduler_name                   = (known after apply)
                  [32m+[0m[0m service_account_name             = (known after apply)
                  [32m+[0m[0m share_process_namespace          = false
                  [32m+[0m[0m termination_grace_period_seconds = 30

                  [32m+[0m[0m container {
                      [32m+[0m[0m image                      = "nginx:1.25-alpine"
                      [32m+[0m[0m image_pull_policy          = (known after apply)
                      [32m+[0m[0m name                       = "nginx"
                      [32m+[0m[0m stdin                      = false
                      [32m+[0m[0m stdin_once                 = false
                      [32m+[0m[0m termination_message_path   = "/dev/termination-log"
                      [32m+[0m[0m termination_message_policy = (known after apply)
                      [32m+[0m[0m tty                        = false

                      [32m+[0m[0m liveness_probe {
                          [32m+[0m[0m failure_threshold     = 3
                          [32m+[0m[0m initial_delay_seconds = 5
                          [32m+[0m[0m period_seconds        = 10
                          [32m+[0m[0m success_threshold     = 1
                          [32m+[0m[0m timeout_seconds       = 1

                          [32m+[0m[0m http_get {
                              [32m+[0m[0m path   = "/healthz"
                              [32m+[0m[0m port   = "8080"
                              [32m+[0m[0m scheme = "HTTP"
                            }
                        }

                      [32m+[0m[0m port {
                          [32m+[0m[0m container_port = 8080
                          [32m+[0m[0m protocol       = "TCP"
                        }

                      [32m+[0m[0m readiness_probe {
                          [32m+[0m[0m failure_threshold     = 3
                          [32m+[0m[0m initial_delay_seconds = 5
                          [32m+[0m[0m period_seconds        = 5
                          [32m+[0m[0m success_threshold     = 1
                          [32m+[0m[0m timeout_seconds       = 1

                          [32m+[0m[0m http_get {
                              [32m+[0m[0m path   = "/healthz"
                              [32m+[0m[0m port   = "8080"
                              [32m+[0m[0m scheme = "HTTP"
                            }
                        }

                      [32m+[0m[0m resources {
                          [32m+[0m[0m limits   = {
                              [32m+[0m[0m "cpu"    = "100m"
                              [32m+[0m[0m "memory" = "64Mi"
                            }
                          [32m+[0m[0m requests = {
                              [32m+[0m[0m "cpu"    = "10m"
                              [32m+[0m[0m "memory" = "16Mi"
                            }
                        }

                      [32m+[0m[0m volume_mount {
                          [32m+[0m[0m mount_path        = "/etc/nginx/nginx.conf"
                          [32m+[0m[0m mount_propagation = "None"
                          [32m+[0m[0m name              = "config"
                          [32m+[0m[0m read_only         = false
                          [32m+[0m[0m sub_path          = "nginx.conf"
                        }
                    }

                  [32m+[0m[0m volume {
                      [32m+[0m[0m name = "config"

                      [32m+[0m[0m config_map {
                          [32m+[0m[0m default_mode = "0644"
                          [32m+[0m[0m name         = "kubecost-proxy-config"
                        }
                    }
                }
            }
        }
    }

[1m  # module.kubecost[0].kubernetes_namespace.kubecost[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_namespace" "kubecost" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m wait_for_default_service_account = false

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m labels           = {
              [32m+[0m[0m "name" = "kubecost"
            }
          [32m+[0m[0m name             = "kubecost"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # module.kubecost[0].kubernetes_service.kubecost_proxy[0][0m will be created
[0m  [32m+[0m[0m resource "kubernetes_service" "kubecost_proxy" {
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m wait_for_load_balancer = true

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m name             = "kubecost-proxy"
          [32m+[0m[0m namespace        = "kubecost"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }

      [32m+[0m[0m spec {
          [32m+[0m[0m allocate_load_balancer_node_ports = true
          [32m+[0m[0m cluster_ip                        = (known after apply)
          [32m+[0m[0m cluster_ips                       = (known after apply)
          [32m+[0m[0m external_traffic_policy           = (known after apply)
          [32m+[0m[0m health_check_node_port            = (known after apply)
          [32m+[0m[0m internal_traffic_policy           = (known after apply)
          [32m+[0m[0m ip_families                       = (known after apply)
          [32m+[0m[0m ip_family_policy                  = (known after apply)
          [32m+[0m[0m publish_not_ready_addresses       = false
          [32m+[0m[0m selector                          = {
              [32m+[0m[0m "app" = "kubecost-proxy"
            }
          [32m+[0m[0m session_affinity                  = "None"
          [32m+[0m[0m type                              = "ClusterIP"

          [32m+[0m[0m port {
              [32m+[0m[0m node_port   = (known after apply)
              [32m+[0m[0m port        = 9090
              [32m+[0m[0m protocol    = "TCP"
              [32m+[0m[0m target_port = "8080"
            }
        }
    }

[1m  # module.kubecost[0].kubernetes_service_account.kubecost[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_service_account" "kubecost" {
      [32m+[0m[0m automount_service_account_token = true
      [32m+[0m[0m default_secret_name             = (known after apply)
      [32m+[0m[0m id                              = (known after apply)

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m name             = "kubecost-cost-analyzer"
          [32m+[0m[0m namespace        = "kubecost"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # module.kubernetes.kubernetes_annotations.gp2_not_default[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_annotations" "gp2_not_default" {
      [32m+[0m[0m annotations   = {
          [32m+[0m[0m "storageclass.kubernetes.io/is-default-class" = "false"
        }
      [32m+[0m[0m api_version   = "storage.k8s.io/v1"
      [32m+[0m[0m field_manager = "Terraform"
      [32m+[0m[0m force         = false
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m kind          = "StorageClass"

      [32m+[0m[0m metadata {
          [32m+[0m[0m name = "gp2"
        }
    }

[1m  # module.kubernetes.kubernetes_config_map_v1_data.aws_auth[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_config_map_v1_data" "aws_auth" {
      [32m+[0m[0m data          = {
          [32m+[0m[0m "mapRoles" = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::390197508439:role/jupyterhub-cae-dev-node-role"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          [32m+[0m[0m "mapUsers" = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::390197508439:user/neil.AE"
                  "username": "neil.AE"
            EOT
        }
      [32m+[0m[0m field_manager = "Terraform"
      [32m+[0m[0m force         = true
      [32m+[0m[0m id            = (known after apply)

      [32m+[0m[0m metadata {
          [32m+[0m[0m name      = "aws-auth"
          [32m+[0m[0m namespace = "kube-system"
        }
    }

[1m  # module.kubernetes.kubernetes_namespace.daskhub[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_namespace" "daskhub" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m wait_for_default_service_account = false

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m labels           = {
              [32m+[0m[0m "name" = "daskhub"
            }
          [32m+[0m[0m name             = "daskhub"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # module.kubernetes.kubernetes_service_account.user_sa[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_service_account" "user_sa" {
      [32m+[0m[0m automount_service_account_token = true
      [32m+[0m[0m default_secret_name             = (known after apply)
      [32m+[0m[0m id                              = (known after apply)

      [32m+[0m[0m metadata {
          [32m+[0m[0m generation       = (known after apply)
          [32m+[0m[0m name             = "user-sa"
          [32m+[0m[0m namespace        = "daskhub"
          [32m+[0m[0m resource_version = (known after apply)
          [32m+[0m[0m uid              = (known after apply)
        }
    }

[1m  # module.kubernetes.kubernetes_storage_class_v1.gp3[0m will be created
[0m  [32m+[0m[0m resource "kubernetes_storage_class_v1" "gp3" {
      [32m+[0m[0m allow_volume_expansion = true
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m parameters             = {
          [32m+[0m[0m "encrypted" = "true"
          [32m+[0m[0m "fsType"    = "ext4"
          [32m+[0m[0m "type"      = "gp3"
        }
      [32m+[0m[0m reclaim_pol
... (truncated)
```

</details>

*Pushed by: @espg, Action: `pull_request`*